; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=198, out_folder=./training, instance_id=26, seed=2050, goal_proportion=0.03

(define (problem blocksworld-26)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 - object)
 (:init 
    (arm-empty)
    (clear b29)
    (on b29 b183)
    (on-table b183)
    (clear b53)
    (on b53 b66)
    (on b66 b145)
    (on-table b145)
    (clear b175)
    (on b175 b128)
    (on b128 b22)
    (on b22 b122)
    (on-table b122)
    (clear b44)
    (on b44 b23)
    (on b23 b139)
    (on b139 b104)
    (on-table b104)
    (clear b147)
    (on b147 b174)
    (on-table b174)
    (clear b32)
    (on b32 b138)
    (on b138 b119)
    (on b119 b162)
    (on b162 b46)
    (on b46 b115)
    (on b115 b18)
    (on-table b18)
    (clear b45)
    (on b45 b131)
    (on b131 b100)
    (on b100 b34)
    (on-table b34)
    (clear b79)
    (on b79 b135)
    (on b135 b164)
    (on-table b164)
    (clear b185)
    (on b185 b6)
    (on-table b6)
    (clear b31)
    (on b31 b15)
    (on-table b15)
    (clear b150)
    (on-table b150)
    (clear b117)
    (on b117 b146)
    (on-table b146)
    (clear b13)
    (on b13 b166)
    (on b166 b101)
    (on-table b101)
    (clear b127)
    (on b127 b8)
    (on-table b8)
    (clear b99)
    (on b99 b36)
    (on b36 b173)
    (on-table b173)
    (clear b133)
    (on b133 b73)
    (on-table b73)
    (clear b98)
    (on-table b98)
    (clear b116)
    (on b116 b27)
    (on b27 b114)
    (on b114 b163)
    (on b163 b76)
    (on-table b76)
    (clear b184)
    (on b184 b9)
    (on-table b9)
    (clear b89)
    (on b89 b85)
    (on b85 b35)
    (on-table b35)
    (clear b118)
    (on-table b118)
    (clear b11)
    (on b11 b21)
    (on-table b21)
    (clear b169)
    (on b169 b43)
    (on b43 b58)
    (on b58 b121)
    (on b121 b120)
    (on b120 b60)
    (on b60 b181)
    (on b181 b74)
    (on b74 b197)
    (on b197 b192)
    (on b192 b1)
    (on b1 b62)
    (on b62 b14)
    (on b14 b178)
    (on b178 b193)
    (on b193 b179)
    (on b179 b49)
    (on-table b49)
    (clear b39)
    (on-table b39)
    (clear b153)
    (on b153 b194)
    (on b194 b63)
    (on b63 b78)
    (on b78 b143)
    (on b143 b48)
    (on b48 b77)
    (on-table b77)
    (clear b75)
    (on b75 b107)
    (on b107 b51)
    (on b51 b149)
    (on b149 b80)
    (on b80 b83)
    (on b83 b33)
    (on b33 b59)
    (on-table b59)
    (clear b40)
    (on b40 b52)
    (on b52 b168)
    (on b168 b110)
    (on b110 b103)
    (on b103 b156)
    (on b156 b3)
    (on b3 b136)
    (on b136 b158)
    (on b158 b88)
    (on-table b88)
    (clear b54)
    (on b54 b84)
    (on-table b84)
    (clear b26)
    (on b26 b148)
    (on b148 b2)
    (on b2 b102)
    (on b102 b129)
    (on-table b129)
    (clear b67)
    (on-table b67)
    (clear b87)
    (on b87 b140)
    (on b140 b70)
    (on b70 b5)
    (on b5 b188)
    (on b188 b142)
    (on b142 b24)
    (on b24 b161)
    (on b161 b25)
    (on b25 b172)
    (on b172 b37)
    (on b37 b196)
    (on b196 b42)
    (on b42 b7)
    (on b7 b141)
    (on b141 b190)
    (on b190 b28)
    (on b28 b38)
    (on b38 b47)
    (on b47 b109)
    (on-table b109)
    (clear b126)
    (on b126 b10)
    (on-table b10)
    (clear b57)
    (on b57 b16)
    (on b16 b41)
    (on b41 b4)
    (on-table b4)
    (clear b50)
    (on b50 b30)
    (on b30 b170)
    (on-table b170)
    (clear b137)
    (on-table b137)
    (clear b94)
    (on b94 b82)
    (on b82 b55)
    (on-table b55)
    (clear b144)
    (on b144 b95)
    (on b95 b132)
    (on-table b132)
    (clear b151)
    (on b151 b177)
    (on-table b177)
    (clear b160)
    (on-table b160)
    (clear b113)
    (on b113 b130)
    (on b130 b157)
    (on b157 b180)
    (on b180 b106)
    (on b106 b108)
    (on b108 b155)
    (on-table b155)
    (clear b20)
    (on b20 b176)
    (on b176 b124)
    (on b124 b123)
    (on b123 b81)
    (on-table b81)
    (clear b61)
    (on b61 b68)
    (on b68 b191)
    (on b191 b111)
    (on b111 b182)
    (on b182 b134)
    (on b134 b72)
    (on b72 b71)
    (on b71 b12)
    (on-table b12)
    (clear b93)
    (on-table b93)
    (clear b112)
    (on b112 b125)
    (on-table b125)
    (clear b17)
    (on b17 b65)
    (on-table b65)
    (clear b64)
    (on b64 b198)
    (on b198 b19)
    (on b19 b195)
    (on b195 b90)
    (on b90 b96)
    (on b96 b159)
    (on-table b159)
    (clear b187)
    (on b187 b154)
    (on b154 b167)
    (on b167 b165)
    (on b165 b171)
    (on-table b171)
    (clear b189)
    (on b189 b92)
    (on-table b92)
    (clear b105)
    (on b105 b91)
    (on-table b91)
    (clear b186)
    (on-table b186)
    (clear b69)
    (on b69 b97)
    (on-table b97)
    (clear b56)
    (on b56 b86)
    (on b86 b152)
    (on-table b152))
 (:goal  (and 
    (clear b1)
    (on b1 b2)
    (on-table b2)
    (clear b4)
    (on b4 b5)
    (on b5 b3)
    (on-table b3))))

; plan
1. (unstack b169 b43)
   deleted: (on b169 b43) (clear b169) (arm-empty)
   added: (holding b169) (clear b43)
   goals met: 0 of 7
2. (putdown b169)
   deleted: (holding b169)
   added: (clear b169) (arm-empty) (on-table b169)
   goals met: 0 of 7
3. (unstack b26 b148)
   deleted: (on b26 b148) (clear b26) (arm-empty)
   added: (holding b26) (clear b148)
   goals met: 0 of 7
4. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 0 of 7
5. (unstack b148 b2)
   deleted: (on b148 b2) (clear b148) (arm-empty)
   added: (holding b148) (clear b2)
   goals met: 0 of 7
6. (putdown b148)
   deleted: (holding b148)
   added: (clear b148) (arm-empty) (on-table b148)
   goals met: 0 of 7
7. (unstack b2 b102)
   deleted: (on b2 b102) (clear b2) (arm-empty)
   added: (holding b2) (clear b102)
   goals met: 0 of 7
8. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 1 of 7
9. (unstack b40 b52)
   deleted: (on b40 b52) (clear b40) (arm-empty)
   added: (holding b40) (clear b52)
   goals met: 1 of 7
10. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 1 of 7
11. (unstack b43 b58)
   deleted: (on b43 b58) (clear b43) (arm-empty)
   added: (holding b43) (clear b58)
   goals met: 1 of 7
12. (putdown b43)
   deleted: (holding b43)
   added: (clear b43) (arm-empty) (on-table b43)
   goals met: 1 of 7
13. (unstack b52 b168)
   deleted: (on b52 b168) (clear b52) (arm-empty)
   added: (holding b52) (clear b168)
   goals met: 1 of 7
14. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 1 of 7
15. (unstack b168 b110)
   deleted: (on b168 b110) (clear b168) (arm-empty)
   added: (holding b168) (clear b110)
   goals met: 1 of 7
16. (putdown b168)
   deleted: (holding b168)
   added: (clear b168) (arm-empty) (on-table b168)
   goals met: 1 of 7
17. (unstack b110 b103)
   deleted: (on b110 b103) (clear b110) (arm-empty)
   added: (holding b110) (clear b103)
   goals met: 1 of 7
18. (putdown b110)
   deleted: (holding b110)
   added: (clear b110) (arm-empty) (on-table b110)
   goals met: 1 of 7
19. (unstack b103 b156)
   deleted: (on b103 b156) (clear b103) (arm-empty)
   added: (holding b103) (clear b156)
   goals met: 1 of 7
20. (putdown b103)
   deleted: (holding b103)
   added: (clear b103) (arm-empty) (on-table b103)
   goals met: 1 of 7
21. (unstack b156 b3)
   deleted: (on b156 b3) (clear b156) (arm-empty)
   added: (holding b156) (clear b3)
   goals met: 1 of 7
22. (putdown b156)
   deleted: (holding b156)
   added: (clear b156) (arm-empty) (on-table b156)
   goals met: 1 of 7
23. (unstack b3 b136)
   deleted: (on b3 b136) (clear b3) (arm-empty)
   added: (holding b3) (clear b136)
   goals met: 1 of 7
24. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 2 of 7
25. (unstack b57 b16)
   deleted: (on b57 b16) (clear b57) (arm-empty)
   added: (holding b57) (clear b16)
   goals met: 2 of 7
26. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 2 of 7
27. (unstack b16 b41)
   deleted: (on b16 b41) (clear b16) (arm-empty)
   added: (holding b16) (clear b41)
   goals met: 2 of 7
28. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 2 of 7
29. (unstack b41 b4)
   deleted: (on b41 b4) (clear b41) (arm-empty)
   added: (holding b41) (clear b4)
   goals met: 3 of 7
30. (putdown b41)
   deleted: (holding b41)
   added: (clear b41) (arm-empty) (on-table b41)
   goals met: 3 of 7
31. (unstack b58 b121)
   deleted: (on b58 b121) (clear b58) (arm-empty)
   added: (holding b58) (clear b121)
   goals met: 3 of 7
32. (putdown b58)
   deleted: (holding b58)
   added: (clear b58) (arm-empty) (on-table b58)
   goals met: 3 of 7
33. (unstack b121 b120)
   deleted: (on b121 b120) (clear b121) (arm-empty)
   added: (holding b121) (clear b120)
   goals met: 3 of 7
34. (putdown b121)
   deleted: (holding b121)
   added: (clear b121) (arm-empty) (on-table b121)
   goals met: 3 of 7
35. (unstack b120 b60)
   deleted: (on b120 b60) (clear b120) (arm-empty)
   added: (holding b120) (clear b60)
   goals met: 3 of 7
36. (putdown b120)
   deleted: (holding b120)
   added: (clear b120) (arm-empty) (on-table b120)
   goals met: 3 of 7
37. (unstack b60 b181)
   deleted: (on b60 b181) (clear b60) (arm-empty)
   added: (holding b60) (clear b181)
   goals met: 3 of 7
38. (putdown b60)
   deleted: (holding b60)
   added: (clear b60) (arm-empty) (on-table b60)
   goals met: 3 of 7
39. (unstack b181 b74)
   deleted: (on b181 b74) (clear b181) (arm-empty)
   added: (holding b181) (clear b74)
   goals met: 3 of 7
40. (putdown b181)
   deleted: (holding b181)
   added: (clear b181) (arm-empty) (on-table b181)
   goals met: 3 of 7
41. (unstack b74 b197)
   deleted: (on b74 b197) (clear b74) (arm-empty)
   added: (holding b74) (clear b197)
   goals met: 3 of 7
42. (putdown b74)
   deleted: (holding b74)
   added: (clear b74) (arm-empty) (on-table b74)
   goals met: 3 of 7
43. (unstack b197 b192)
   deleted: (on b197 b192) (clear b197) (arm-empty)
   added: (holding b197) (clear b192)
   goals met: 3 of 7
44. (putdown b197)
   deleted: (holding b197)
   added: (clear b197) (arm-empty) (on-table b197)
   goals met: 3 of 7
45. (unstack b192 b1)
   deleted: (on b192 b1) (clear b192) (arm-empty)
   added: (holding b192) (clear b1)
   goals met: 4 of 7
46. (putdown b192)
   deleted: (holding b192)
   added: (clear b192) (arm-empty) (on-table b192)
   goals met: 4 of 7
47. (unstack b87 b140)
   deleted: (on b87 b140) (clear b87) (arm-empty)
   added: (holding b87) (clear b140)
   goals met: 4 of 7
48. (putdown b87)
   deleted: (holding b87)
   added: (clear b87) (arm-empty) (on-table b87)
   goals met: 4 of 7
49. (unstack b140 b70)
   deleted: (on b140 b70) (clear b140) (arm-empty)
   added: (holding b140) (clear b70)
   goals met: 4 of 7
50. (putdown b140)
   deleted: (holding b140)
   added: (clear b140) (arm-empty) (on-table b140)
   goals met: 4 of 7
51. (unstack b70 b5)
   deleted: (on b70 b5) (clear b70) (arm-empty)
   added: (holding b70) (clear b5)
   goals met: 4 of 7
52. (putdown b70)
   deleted: (holding b70)
   added: (clear b70) (arm-empty) (on-table b70)
   goals met: 4 of 7
53. (unstack b5 b188)
   deleted: (on b5 b188) (clear b5) (arm-empty)
   added: (holding b5) (clear b188)
   goals met: 4 of 7
54. (stack b5 b3)
   deleted: (clear b3) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b3)
   goals met: 5 of 7
55. (unstack b1 b62)
   deleted: (on b1 b62) (clear b1) (arm-empty)
   added: (holding b1) (clear b62)
   goals met: 4 of 7
56. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 6 of 7
57. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 5 of 7
58. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 7 of 7
